ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьЯчейкуОтветственногоХранения() Экспорт
	
	Если ЗначениеЗаполнено(ЯчейкаОтветственногоХранения) Тогда
		Возврат ЯчейкаОтветственногоХранения;
	КонецЕсли;
	
	ЧастиИмени = вмс_РаботаСКоллекциями.СтрокуВМассив(Оператор.Наименование, " ");
	Для НомерЧасти=1 По ЧастиИмени.Количество() Цикл
		ЧастьИмени = СтрЗаменить(ЧастиИмени[НомерЧасти-1], " ", "");
		ЧастиИмени[НомерЧасти-1] = ВРег(Лев(ЧастьИмени, 1));
	КонецЦикла;
	
	ЯчейкаОтветственногоХраненияОбъект = Справочники.вмс_МестаХранения.СоздатьЭлемент();
	ЯчейкаОтветственногоХраненияОбъект.Заполнить(Неопределено);
	ЯчейкаОтветственногоХраненияОбъект.Родитель = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьГруппуЯчеекОтветственногоХранения();
	ЯчейкаОтветственногоХраненияОбъект.Наименование = вмс_РаботаСКоллекциями.МассивВСтроку(ЧастиИмени, ".");
	ЯчейкаОтветственногоХраненияОбъект.ТипЯчейки=Перечисления.вмс_ТипыЯчеек.Оператор;
	ЯчейкаОтветственногоХраненияОбъект.Записать();
	
	ЯчейкаОтветственногоХранения = ЯчейкаОтветственногоХраненияОбъект.Ссылка;
	Возврат ЯчейкаОтветственногоХранения;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	ПолучитьЯчейкуОтветственногоХранения();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЯчейкаОтветственногоХранения = Неопределено;
КонецПроцедуры

// ТУ_Самойленко 10.08.23 ++
Процедура СменитьПринтерПоУмолчанию(ПринтерПоУмолчанию=Неопределено, ФорматПечати=Неопределено) Экспорт	
	
	ФорматПечати = ?(ПринтерПоУмолчанию=Неопределено,ФорматПечати,ПринтерПоУмолчанию.ФорматПечати);
	
	Строки = Принтеры.НайтиСтроки(Новый Структура("ПоУмолчанию", Истина));
	
	Если ФорматПечати <> Неопределено Тогда
		Для Каждого Строка Из Строки Цикл
			Если Строка.Принтер.ФорматПечати = ФорматПечати Тогда
				Строка.ПоУмолчанию = Ложь;
			КонецЕсли;
		КонецЦикла;	
	Иначе
		Для Каждого Строка Из Строки Цикл
			Строка.ПоУмолчанию = Ложь;
		КонецЦикла;	
	КонецЕсли;
	
	Если ПринтерПоУмолчанию <> Неопределено Тогда	
		
		НовыйПоУмолчанию = Принтеры.НайтиСтроки(Новый Структура("Принтер", ПринтерПоУмолчанию));
		
		Если ЗначениеЗаполнено(НовыйПоУмолчанию) Тогда
			НовыйПоУмолчанию[0].ПоУмолчанию = Истина;	
		КонецЕсли;
		
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	МасштабФормы = 100;
	
КонецПроцедуры

#Иначе

#КонецЕсли
